app/Controllers/User.php

    public function prosesSuratKontrak()
    {
        $request = service('request');

        // Ambil data dari form
        $buku_up = $request->getPost('buku_up');
        $uraian_sk_up = $request->getPost('uraian_sk_up');
        $no_st = $request->getPost('no_st');
        $nu_kontrak = $request->getPost('nu_kontrak');
        $bln_angka = $request->getPost('bln_angka');
        $hari_kontrak = $request->getPost('hari_kontrak');
        $tgl_huruf = $request->getPost('tgl_huruf');
        $bln_huruf = $request->getPost('bln_huruf');
        $sobat_id = $request->getPost('sobat_id'); // Ambil sobat_id dari form
        $nik_petugas_kontrak = $request->getPost('nik_petugas_kontrak');
        $alamat_petugas_kontrak = $request->getPost('alamat_petugas_kontrak');
        $jabatan_petugas = $request->getPost('jabatan_petugas');
        $tgl_mulai = $request->getPost('tgl_mulai');
        $tgl_selesai = $request->getPost('tgl_selesai');
        $honorarium_kontrak = $request->getPost('honorarium_kontrak');
        $ttd_petugas = $request->getPost('ttd_petugas');

        // Ambil data mitra berdasarkan sobat_id
        $mitra = $this->suratKontrakModel->db->table('mitra_statistik')->where('sobat_id', $sobat_id)->get()->getFirstRow('array');
---
SELECT *
FROM `mitra_statistik`
WHERE `sobat_id` = '327223110061'

        ];

        // Simpan data ke database
        $this->suratKontrakModel->insert($data);
---
INSERT INTO `surat_kontrak` (`buku_up`, `uraian_sk_up`, `no_st`, `nu_kontrak`, `bln_angka`, `hari_kontrak`, `tgl_huruf`, `bln_huruf`, `nama_petugas_kontrak`, `nik_petugas_kontrak`, `alamat_petugas_kontrak`, `jabatan_petugas`, `tgl_mulai`, `tgl_selesai`, `honorarium_kontrak`, `sebagai_kontrak`, `ttd_petugas`) VALUES ('PETUGAS LAPANGAN SURVEI', 'ANGKATAN KERJA NASIONAL NOVEMBER', '099', '05', '11', 'Jumat', 'Lima Belas', 'November', 'Ati Nurhayati', '3202292305030005', 'Jl. Selabintana no.14, Kota  Sukabumi', 'PETUGAS PENCACAH LAPANGAN SURVEI', '2024-11-16', '2024-11-29', 'Rp280.000', 'Mitra Pendataan', 'Ati Nurhayati')