app/Models/AdminModel.php

SELECT *
FROM `mitra_statistik`
---
    public function mitraStatistik()
    {
        return $this->db->table('mitra_statistik')
            ->select('*')
            ->get()->getResultArray();

UPDATE `mitra_statistik` SET `sobat_id` = '3272220200077', `satker` = '(3272) BPS Kota Sukabumi', `nama_pegawai` = 'Verdi Eza Irawan', `jenis_kelamin` = 'Laki-laki', `email` = 'verdieza@gmail.com', `posisi` = 'Mitra Pendataan'
WHERE `id` = '246'
---
    public function updateMitra($id, $data)
    {
        return $this->db->table('mitra_statistik')
                        ->where('id', $id)
                        ->update($data);

DELETE FROM `mitra_statistik`
WHERE `id` = '246'
---
    public function deleteMitra($id)
    {
        return $this->db->table('mitra_statistik')
                        ->where('id', $id)
                        ->delete();

SELECT *
FROM `penanggungjawab`
---
    public function penanggungjawab()
    {
        return $this->db->table('penanggungjawab')
                        ->select('*')
                        ->get()
                        ->getResultArray();

INSERT INTO `penanggungjawab` (`jabatan`, `nama`, `nip`) VALUES ('BENDAHARA UTAMA', 'Rafli Dwi Praja', '2130511081')
---
    public function addPenanggungjawab($data)
    {
        return $this->db->table('penanggungjawab')
                        ->insert($data);

UPDATE `penanggungjawab` SET `jabatan` = 'Kepala Data', `nama` = 'Rafli Dwi Praja', `nip` = '2130511081'
WHERE `id` = '9'
---
    public function updatePenanggungjawab($id, $data)
    {
        return $this->db->table('penanggungjawab')
                        ->where('id', $id)
                        ->update($data);

DELETE FROM `penanggungjawab`
WHERE `id` = '9'
---
    public function deletePenanggungjawab($id)
    {
        return $this->db->table('penanggungjawab')
                        ->where('id', $id)
                        ->delete();