app/Models/SuratKontrakModel.php

    public function getPetugas($searchTerm)
    {
        $builder = $this->db->table('mitra_statistik');
        $builder->like('sobat_id', $searchTerm);
        $query = $builder->get();
---
SELECT *
FROM `mitra_statistik`
WHERE `sobat_id` LIKE '%32%' ESCAPE '!'